Revit 2027 API
DirectShape.AreOptionsValid Method
 Validates that the given DirectShapeOptions are allowed for this particular DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AreOptionsValid(
	DirectShapeOptions options
)
Public Function AreOptionsValid (
	options As DirectShapeOptions
) As Boolean
public:
bool AreOptionsValid(
	DirectShapeOptions^ options
)
member AreOptionsValid :
        options : DirectShapeOptions -> bool
Parameters
options DirectShapeOptions
 The options object.
Return Value
Boolean
 True if the DirectShapeOptions are valid; false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace